-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 16, 2025 at 09:33 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `school`
--

-- --------------------------------------------------------

--
-- Table structure for table `attendance`
--

CREATE TABLE `attendance` (
  `id` int(11) NOT NULL,
  `nationalCode` varchar(10) NOT NULL,
  `fullName` varchar(255) NOT NULL,
  `classId` int(11) DEFAULT NULL,
  `className` varchar(255) DEFAULT NULL,
  `jalali_date` varchar(10) NOT NULL,
  `gregorian_date` date NOT NULL,
  `checkin_time` varchar(8) NOT NULL,
  `location` varchar(255) NOT NULL,
  `dayOfWeek` varchar(20) DEFAULT NULL,
  `status` enum('present','absent') DEFAULT 'present',
  `subjectId` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `attendance`
--

INSERT INTO `attendance` (`id`, `nationalCode`, `fullName`, `classId`, `className`, `jalali_date`, `gregorian_date`, `checkin_time`, `location`, `dayOfWeek`, `status`, `subjectId`, `created_at`) VALUES
(21, '3381704664', 'احمدرضا آوندی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '07:30:00', 'کلاس درس', 'شنبه', 'present', 2, '2025-11-16 20:19:20'),
(22, '2500682358', 'سید محمد مهدی اشرفی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '07:30:00', 'کلاس درس', 'شنبه', 'present', 2, '2025-11-16 20:19:20'),
(23, '3381792441', 'طاها هاشمی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '07:30:00', 'کلاس درس', 'شنبه', 'present', 2, '2025-11-16 20:19:20'),
(24, '3381695444', 'علی اردیبهشتی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '07:30:00', 'کلاس درس', 'شنبه', 'present', 2, '2025-11-16 20:19:20'),
(25, '3381704664', 'احمدرضا آوندی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '09:00:00', 'کلاس درس', 'شنبه', 'present', 3, '2025-11-16 20:19:20'),
(26, '2500682358', 'سید محمد مهدی اشرفی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '09:00:00', 'کلاس درس', 'شنبه', 'present', 3, '2025-11-16 20:19:20'),
(27, '3381792441', 'طاها هاشمی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '09:00:00', 'کلاس درس', 'شنبه', 'present', 3, '2025-11-16 20:19:20'),
(28, '3381695444', 'علی اردیبهشتی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '09:00:00', 'کلاس درس', 'شنبه', 'present', 3, '2025-11-16 20:19:20'),
(29, '3381704664', 'احمدرضا آوندی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '10:30:00', 'کلاس درس', 'شنبه', 'present', 4, '2025-11-16 20:19:20'),
(30, '2500682358', 'سید محمد مهدی اشرفی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '10:30:00', 'کلاس درس', 'شنبه', 'present', 4, '2025-11-16 20:19:20'),
(31, '3381792441', 'طاها هاشمی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '10:30:00', 'کلاس درس', 'شنبه', 'present', 4, '2025-11-16 20:19:20'),
(32, '3381695444', 'علی اردیبهشتی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '10:30:00', 'کلاس درس', 'شنبه', 'present', 4, '2025-11-16 20:19:20'),
(33, '3381704664', 'احمدرضا آوندی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '12:30:00', 'کلاس درس', 'شنبه', 'present', 5, '2025-11-16 20:19:20'),
(34, '2500682358', 'سید محمد مهدی اشرفی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '12:30:00', 'کلاس درس', 'شنبه', 'present', 5, '2025-11-16 20:19:20'),
(35, '3381792441', 'طاها هاشمی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '12:30:00', 'کلاس درس', 'شنبه', 'present', 5, '2025-11-16 20:19:20'),
(36, '3381695444', 'علی اردیبهشتی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/26', '2025-11-16', '12:30:00', 'کلاس درس', 'شنبه', 'present', 5, '2025-11-16 20:19:20'),
(37, '3381704664', 'احمدرضا آوندی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '23:56:23', 'سیستم مدیریت', 'شنبه', 'present', 2, '2025-11-16 20:26:23'),
(38, '۲۵۰۰۶۸۲۳۵۸', 'سید محمد مهدی اشرفی ', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:00:47', 'سیستم مدیریت', 'شنبه', 'present', 4, '2025-11-16 20:30:47'),
(39, '3381704664', 'احمدرضا آوندی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:00:48', 'سیستم مدیریت', 'شنبه', 'present', 4, '2025-11-16 20:30:48'),
(40, '۲۵۰۰۶۸۲۳۵۸', 'سید محمد مهدی اشرفی ', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:00:59', 'سیستم مدیریت', 'شنبه', 'present', 2, '2025-11-16 20:30:59'),
(41, '3381792441', 'طاها هاشمی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:00', 'سیستم مدیریت', 'شنبه', 'present', 2, '2025-11-16 20:31:00'),
(42, '3381695444', 'علی اردیبهشتی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:00', 'سیستم مدیریت', 'شنبه', 'present', 2, '2025-11-16 20:31:00'),
(43, '3381704664', 'احمدرضا آوندی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:11', 'سیستم مدیریت', 'شنبه', 'present', 3, '2025-11-16 20:31:11'),
(44, '۲۵۰۰۶۸۲۳۵۸', 'سید محمد مهدی اشرفی ', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:11', 'سیستم مدیریت', 'شنبه', 'present', 3, '2025-11-16 20:31:11'),
(45, '3381792441', 'طاها هاشمی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:12', 'سیستم مدیریت', 'شنبه', 'present', 3, '2025-11-16 20:31:12'),
(46, '3381695444', 'علی اردیبهشتی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:12', 'سیستم مدیریت', 'شنبه', 'present', 3, '2025-11-16 20:31:12'),
(47, '3381792441', 'طاها هاشمی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:18', 'سیستم مدیریت', 'شنبه', 'present', 4, '2025-11-16 20:31:18'),
(48, '3381695444', 'علی اردیبهشتی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:19', 'سیستم مدیریت', 'شنبه', 'present', 4, '2025-11-16 20:31:19'),
(49, '3381704664', 'احمدرضا آوندی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:23', 'سیستم مدیریت', 'شنبه', 'present', 5, '2025-11-16 20:31:23'),
(50, '۲۵۰۰۶۸۲۳۵۸', 'سید محمد مهدی اشرفی ', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:23', 'سیستم مدیریت', 'شنبه', 'present', 5, '2025-11-16 20:31:23'),
(51, '3381792441', 'طاها هاشمی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:24', 'سیستم مدیریت', 'شنبه', 'present', 5, '2025-11-16 20:31:24'),
(52, '3381695444', 'علی اردیبهشتی', 7, 'دوازدهم شبکه و نرم افزار', '1404/08/24', '2025-11-15', '00:01:24', 'سیستم مدیریت', 'شنبه', 'present', 5, '2025-11-16 20:31:24');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `attendance`
--
ALTER TABLE `attendance`
  ADD PRIMARY KEY (`id`),
  ADD KEY `classId` (`classId`),
  ADD KEY `idx_nationalCode` (`nationalCode`),
  ADD KEY `idx_date` (`jalali_date`),
  ADD KEY `idx_status` (`status`),
  ADD KEY `idx_subject` (`subjectId`),
  ADD KEY `idx_date_class` (`jalali_date`,`classId`),
  ADD KEY `idx_date_status` (`jalali_date`,`status`),
  ADD KEY `idx_user_date` (`nationalCode`,`jalali_date`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `attendance`
--
ALTER TABLE `attendance`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=53;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `attendance`
--
ALTER TABLE `attendance`
  ADD CONSTRAINT `attendance_ibfk_1` FOREIGN KEY (`classId`) REFERENCES `class` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `attendance_ibfk_2` FOREIGN KEY (`nationalCode`) REFERENCES `user` (`nationalCode`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `attendance_ibfk_3` FOREIGN KEY (`subjectId`) REFERENCES `subject` (`id`) ON DELETE SET NULL;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
